### Import Libraries

In [4]:
import pandas as pd
import sqlite3

#### Create DataFrame

In [7]:
df = pd.DataFrame({'Name' : ['Amir', 'Kalina', 'Szymon', 'Ola', 'Stanislaw', 'Krystian', 'Mathew'],
                   'Age' : [23, 22, 23, 21, 24, 25, 26],
                   'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Male', 'Male'],
                   'Domain': ['Data Scientist', 'Data Anysis', 'Cloud Engineer', 'Mathematician', 'Developer', 
                                                                               'Programmaer', 'Data Engineer'],
                   'Salary': [7000, 7300, 8300, 7100, 8000, 9400, 8200] })
df

        Name  Age  Gender          Domain  Salary
0       Amir   23    Male  Data Scientist    7000
1     Kalina   22  Female     Data Anysis    7300
2     Szymon   23    Male  Cloud Engineer    8300
3        Ola   21  Female   Mathematician    7100
4  Stanislaw   24    Male       Developer    8000
5   Krystian   25    Male     Programmaer    9400
6     Mathew   26    Male   Data Engineer    8200

#### Create a Create Connection

In [8]:
cnn = sqlite3.connect('learn_sql.db')  # connection command create a database

#### Add Data to Database

In [9]:
df.to_sql('Employee', cnn)

#### Load the SQL module to Ipython

In [17]:
%load_ext sql
%sql sqlite:///learn_sql.db

#### Now We Can Run SQL Quieries

In [16]:
%%sql

select * from employee;

 * sqlite:///learn_sql.db
Done.

[(0, 'Amir', 23, 'Male', 'Data Scientist', 7000),
 (1, 'Kalina', 22, 'Female', 'Data Anysis', 7300),
 (2, 'Szymon', 23, 'Male', 'Cloud Engineer', 8300),
 (3, 'Ola', 21, 'Female', 'Mathematician', 7100),
 (4, 'Stanislaw', 24, 'Male', 'Developer', 8000),
 (5, 'Krystian', 25, 'Male', 'Programmaer', 9400),
 (6, 'Mathew', 26, 'Male', 'Data Engineer', 8200)]